<template>
    <div class="wrap_el" >
        <div class="svg_center" @click="cleanBD">
            <svg width="20px" height="20px" viewBox="0 0 48 48" version="1.1" >
                <g stroke="none" stroke-width="1" fill-rule="inherit">
                    <g id="ic_fluent_delete_48_regular"  fill-rule="inherit">
                        <path d="M24,7.25 C27.1017853,7.25 29.629937,9.70601719 29.7458479,12.7794443 L29.75,13 L37,13 C37.6903559,13 38.25,13.5596441 38.25,14.25 C38.25,14.8972087 37.7581253,15.4295339 37.1278052,15.4935464 L37,15.5 L35.909,15.5 L34.2058308,38.0698451 C34.0385226,40.2866784 32.1910211,42 29.9678833,42 L18.0321167,42 C15.8089789,42 13.9614774,40.2866784 13.7941692,38.0698451 L12.09,15.5 L11,15.5 C10.3527913,15.5 9.8204661,15.0081253 9.75645361,14.3778052 L9.75,14.25 C9.75,13.6027913 10.2418747,13.0704661 10.8721948,13.0064536 L11,13 L18.25,13 C18.25,9.82436269 20.8243627,7.25 24,7.25 Z M33.4021054,15.5 L14.5978946,15.5 L16.2870795,37.8817009 C16.3559711,38.7945146 17.116707,39.5 18.0321167,39.5 L29.9678833,39.5 C30.883293,39.5 31.6440289,38.7945146 31.7129205,37.8817009 L33.4021054,15.5 Z M27.25,20.75 C27.8972087,20.75 28.4295339,21.2418747 28.4935464,21.8721948 L28.5,22 L28.5,33 C28.5,33.6903559 27.9403559,34.25 27.25,34.25 C26.6027913,34.25 26.0704661,33.7581253 26.0064536,33.1278052 L26,33 L26,22 C26,21.3096441 26.5596441,20.75 27.25,20.75 Z M20.75,20.75 C21.3972087,20.75 21.9295339,21.2418747 21.9935464,21.8721948 L22,22 L22,33 C22,33.6903559 21.4403559,34.25 20.75,34.25 C20.1027913,34.25 19.5704661,33.7581253 19.5064536,33.1278052 L19.5,33 L19.5,22 C19.5,21.3096441 20.0596441,20.75 20.75,20.75 Z M24,9.75 C22.2669685,9.75 20.8507541,11.1064548 20.7551448,12.8155761 L20.75,13 L27.25,13 C27.25,11.2050746 25.7949254,9.75 24,9.75 Z" id="🎨-Color">
                        </path>
                    </g>
                </g>
            </svg>
        </div>
        <div class="stat_element">
            <b>{{ type }}:</b> {{ volume }} строк
        </div>

    </div>
</template>

<style scoped>
.wrap_el {
    display: flex;
    position: relative;
}
.svg_center {
    cursor: pointer;
    position: absolute;
    top: -3px;
}
svg:hover {
    fill: #f54646;
}
.stat_element {
    position: relative;
    margin-left: 30px;
}

</style>

<script>

export default {
    props: ['type', 'qnt'],
    components: {},

    data() {
        return {
            volume: this.qnt,
            dataset: this.type.toLowerCase().includes('директ') ? "direct" : this.type.toLowerCase().includes('лиды') ? 'lead' : 'sale',
        }
    },
    methods: {
        cleanBD() {
            axios.post('/api/clean_db/' + this.dataset)
                .then(res => {
                    console.log(res);
                    this.volume = 0;
                })
                .catch(res => {
                    // this.signature = 'Error! Ошибка парсинга файла';
                    console.log('FAILURE!! ', res)
                });
        },
    },

    mounted() {

    }
}
</script>
